site/IA-32/index-simd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index-simd</title>
<!-- 2017-11-16 Thu 12:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">index-simd</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> SIMD</h2>
<div class="outline-text-2" id="text-1">
<p>
SIMD signifnica Single Instruction Multiple Data.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Aritmética sobre enteros</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Suma</h4>
<div class="outline-text-4" id="text-1-1-1">
</div><ol class="org-ol"><li><a id="sec-1-1-1-1" name="sec-1-1-1-1"></a><a href="./simd-paddb.html">PADD{B,W,D,Q} p860</a><br  /><div class="outline-text-5" id="text-1-1-1-1">
<p>
Add Packed Integers
</p>
</div>
</li>
<li><a id="sec-1-1-1-2" name="sec-1-1-1-2"></a>PADD{SB,SW}<br  /><div class="outline-text-5" id="text-1-1-1-2">
<p>
Add Packed Signed Integers with Signed Saturation
</p>
</div>
</li>
<li><a id="sec-1-1-1-3" name="sec-1-1-1-3"></a>PADD{USB,USW}<br  /><div class="outline-text-5" id="text-1-1-1-3">
<p>
Add Packed Unsigned Integers with Unsigned Saturation
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Resta</h4>
<div class="outline-text-4" id="text-1-1-2">
</div><ol class="org-ol"><li><a id="sec-1-1-2-1" name="sec-1-1-2-1"></a><a href="./simd-psubb.html">PSUB{B,W,D,Q} p1121</a><br  /><div class="outline-text-5" id="text-1-1-2-1">
<p>
Substract Packed Integers
</p>
</div>
</li>
<li><a id="sec-1-1-2-2" name="sec-1-1-2-2"></a>PSUB{SB,SW}<br  /><div class="outline-text-5" id="text-1-1-2-2">
<p>
Substract Packed Unsigned Integers with Unsigned Saturation
</p>
</div>
</li>
<li><a id="sec-1-1-2-3" name="sec-1-1-2-3"></a>PSUB{USB,USW}<br  /><div class="outline-text-5" id="text-1-1-2-3">
<p>
Substract Packed Unsigned Integers with Unsigned Saturation
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Producto</h4>
<div class="outline-text-4" id="text-1-1-3">
</div><ol class="org-ol"><li><a id="sec-1-1-3-1" name="sec-1-1-3-1"></a>PMULHW p1025<br  /><div class="outline-text-5" id="text-1-1-3-1">
<p>
Multiply Packed Signed Integers and Store High Result
</p>
</div>
</li>
<li><a id="sec-1-1-3-2" name="sec-1-1-3-2"></a>PMULHUW p1021<br  /><div class="outline-text-5" id="text-1-1-3-2">
<p>
Multiply Packed Unsigned Integers and Store High Result
</p>
</div>
</li>
<li><a id="sec-1-1-3-3" name="sec-1-1-3-3"></a>PMULL{D,Q}<br  /><div class="outline-text-5" id="text-1-1-3-3">
<p>
Multiply Packed Integers and Store Low Result
</p>
</div>
</li>
<li><a id="sec-1-1-3-4" name="sec-1-1-3-4"></a>PMULLW<br  /><div class="outline-text-5" id="text-1-1-3-4">
<p>
Multiply Packed Signed Integers and Store Low Result
</p>
</div>
</li>
<li><a id="sec-1-1-3-5" name="sec-1-1-3-5"></a>PMULUDQ<br  /><div class="outline-text-5" id="text-1-1-3-5">
<p>
Multiply Packed Unsigned Doubleword Integers
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Shift Aritmético</h4>
<div class="outline-text-4" id="text-1-1-4">
</div><ol class="org-ol"><li><a id="sec-1-1-4-1" name="sec-1-1-4-1"></a>PSRA{W,D,Q}<br  /><div class="outline-text-5" id="text-1-1-4-1">
<p>
Shift Packed Data Right Aritmetic
</p>
</div>
</li>
<li><a id="sec-1-1-4-2" name="sec-1-1-4-2"></a>PSRLDQ<br  /><div class="outline-text-5" id="text-1-1-4-2">
<p>
Shift Double Quadword Right Logical
</p>
</div>
</li>
<li><a id="sec-1-1-4-3" name="sec-1-1-4-3"></a>PSRL{W,D,Q}<br  /><div class="outline-text-5" id="text-1-1-4-3">
<p>
Shift Packed Data Right Logical
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Conversión</h4>
<div class="outline-text-4" id="text-1-1-5">
</div><ol class="org-ol"><li><a id="sec-1-1-5-1" name="sec-1-1-5-1"></a>CVTDQ2PD<br  /><div class="outline-text-5" id="text-1-1-5-1">
<p>
Convert Packed Doublewords Integers to Packed Double-Precision
Floating-Point Values
</p>
</div>
</li>
<li><a id="sec-1-1-5-2" name="sec-1-1-5-2"></a>CVTDQ2PS<br  /><div class="outline-text-5" id="text-1-1-5-2">
<p>
Convert Packed Doublewords Integers to Packed Single-Precision
Floating-Point Values
</p>
</div>
</li>
<li><a id="sec-1-1-5-3" name="sec-1-1-5-3"></a>CVTPD2DQ<br  /><div class="outline-text-5" id="text-1-1-5-3">
<p>
Convert Packet Double-Precision Floating-Point Values to
Packet Doublwword Integers 
</p>
</div>
</li>
<li><a id="sec-1-1-5-4" name="sec-1-1-5-4"></a>CVTPD2PI<br  /><div class="outline-text-5" id="text-1-1-5-4">
<p>
Convert Packet Double Precision FP Values to Packed Dword Integers
</p>
</div>
</li>
<li><a id="sec-1-1-5-5" name="sec-1-1-5-5"></a>CVTPD2PS<br  /><div class="outline-text-5" id="text-1-1-5-5">
<p>
Convert Packed Double-Precision Floating-Point Values to Packed
Single Precision Floating-Point Values
</p>
</div>
</li>
<li><a id="sec-1-1-5-6" name="sec-1-1-5-6"></a>CVTPI2PD<br  /><div class="outline-text-5" id="text-1-1-5-6">
<p>
Convert Packed Dword Integers to Packed Double Precision FP Values
</p>
</div>
</li>
<li><a id="sec-1-1-5-7" name="sec-1-1-5-7"></a>CVTPI2PS<br  /><div class="outline-text-5" id="text-1-1-5-7">
<p>
Convert Packed Dword Integers to Packed Single-PrecisionFP Values
</p>
</div>
</li>
<li><a id="sec-1-1-5-8" name="sec-1-1-5-8"></a>CVTPS2DQ<br  /><div class="outline-text-5" id="text-1-1-5-8">
<p>
Convert Packed Single-Precision Floating-Point Values to Packed Signed 
Dword Integer Values
</p>
</div>
</li>
<li><a id="sec-1-1-5-9" name="sec-1-1-5-9"></a>CVTPS2PD<br  /><div class="outline-text-5" id="text-1-1-5-9">
<p>
Convert Packed Single-Precision Floating-Point Values to Packed Double 
Precision Floating-Point Values
</p>
</div>
</li>
<li><a id="sec-1-1-5-10" name="sec-1-1-5-10"></a>CVTPS2PI<br  /><div class="outline-text-5" id="text-1-1-5-10">
<p>
Convert Packed Single-Precision Floating-Point Values to Packed Dword
Integers
</p>
</div>
</li>
<li><a id="sec-1-1-5-11" name="sec-1-1-5-11"></a>CVTSI2SD<br  /><div class="outline-text-5" id="text-1-1-5-11">
<p>
Convert Dword Integer to Scalar Double-Precision Floating-Point Value
</p>
</div>
</li>
<li><a id="sec-1-1-5-12" name="sec-1-1-5-12"></a>CVTSI2SS<br  /><div class="outline-text-5" id="text-1-1-5-12">
<p>
Convert Dword Integer to Scalar Single-Precision Floating-Point Value
</p>
</div>
</li>
<li><a id="sec-1-1-5-13" name="sec-1-1-5-13"></a>CVTSS2SD<br  /><div class="outline-text-5" id="text-1-1-5-13">
<p>
Convert Scalar Single-Precision Floating-Point Value to Scalar
Double-Precision Floating-Point Value
</p>
</div>
</li>
<li><a id="sec-1-1-5-14" name="sec-1-1-5-14"></a>CVTSS2SI<br  /><div class="outline-text-5" id="text-1-1-5-14">
<p>
Convert Scalar Single-Precision Floating-Point Value to Dword Integer
</p>
</div>
</li>
<li><a id="sec-1-1-5-15" name="sec-1-1-5-15"></a>CVTTPD2DQ<br  /><div class="outline-text-5" id="text-1-1-5-15">
<p>
Convert with Truncation Packed Double-Precision Floating-Point Values
to Packed Dword Integers
</p>
</div>
</li>
<li><a id="sec-1-1-5-16" name="sec-1-1-5-16"></a>CVTTPD2PI<br  /><div class="outline-text-5" id="text-1-1-5-16">
<p>
Convert with Truncation Packed Double-Precision Floating-Point Values
to Packed Dword Integers 
</p>
</div>
</li>
<li><a id="sec-1-1-5-17" name="sec-1-1-5-17"></a>CVTTPS2DQ<br  /><div class="outline-text-5" id="text-1-1-5-17">
<p>
Convert with Truncation Packed Single-Precision Floating-Point Values
to Packed Signed Dword Integer Values
</p>
</div>
</li>
<li><a id="sec-1-1-5-18" name="sec-1-1-5-18"></a>CVTTPS2PI<br  /><div class="outline-text-5" id="text-1-1-5-18">
<p>
Convert with Truncation Packed Single-Precision Floating-Point Values
to Packed Dword Integers
</p>
</div>
</li>
<li><a id="sec-1-1-5-19" name="sec-1-1-5-19"></a>CVTTSD2SI<br  /><div class="outline-text-5" id="text-1-1-5-19">
<p>
Convert with Truncation Scalar Double-Precision Floating-Point Values
to Signed Integer
</p>
</div>
</li>
<li><a id="sec-1-1-5-20" name="sec-1-1-5-20"></a>CVTTSS2SI<br  /></li></ol>
</div>
<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> Movimiento de datos</h4>
<div class="outline-text-4" id="text-1-1-6">
</div><ol class="org-ol"><li><a id="sec-1-1-6-1" name="sec-1-1-6-1"></a>MOV{D,Q}<br  /><div class="outline-text-5" id="text-1-1-6-1">
<p>
Move Dword/Qword
</p>
</div>
</li>
<li><a id="sec-1-1-6-2" name="sec-1-1-6-2"></a>MOVDDUP<br  /><div class="outline-text-5" id="text-1-1-6-2">
<p>
Replicate Double FP Values
</p>
</div>
</li>
<li><a id="sec-1-1-6-3" name="sec-1-1-6-3"></a>MOVDQ{A,A32/64}<br  /><div class="outline-text-5" id="text-1-1-6-3">
<p>
Move Alinged Packed Integers
</p>
</div>
</li>
<li><a id="sec-1-1-6-4" name="sec-1-1-6-4"></a>MOVDQ{U,U8/16/32/64}<br  /><div class="outline-text-5" id="text-1-1-6-4">
<p>
Move Unaligned Packed Integer Values
</p>
</div>
</li>
<li><a id="sec-1-1-6-5" name="sec-1-1-6-5"></a>MOVDQ2Q<br  /><div class="outline-text-5" id="text-1-1-6-5">
<p>
Move Qword from XMM to MMX Technology Register
</p>
</div>
</li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-11-16 Thu 12:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
